# Chapter 5

## Section 5.5

### Section 5.5.1

In [1]:
import pandas as pd

In [2]:
students = (
    {'FIRST_NAME': ['Daniel', 'Ben', 'Kavita', 'Linda', 
                    'Omar','Jane', 'Felicia', 'Rachel', 
                    'Bob'],
    'LAST_NAME': ['Smith', 'Leibstrom', 'Kanabar', 'Thiel',
                  'Reichel', 'OConner', 'Rao', 'Crock', 
                  'McDonald'],
    'YEAR': [1, 1, 1, 4, 2, 2, 3, 1, 1],
    'HOME_STATE': ['NY', 'NY', 'PA', 'CA', 'OK', 'HI', 
                   'NY','FL', 'FL'],
    'AGE': [18, 19, 19, 22, 21, 19, 20, 17, 18],
    'CALC_101_FINAL': [90, 80, None, 60, 70, None,None, 
                       None, 98],
    'ENGLISH_101_FINAL': [80, None, None, 40, 50, None,
                          None, 60, 65]} )
df_students = pd.DataFrame(students)

In [3]:
df_students

,FIRST_NAME,LAST_NAME,YEAR,HOME_STATE,AGE,CALC_101_FINAL,ENGLISH_101_FINAL
0,Daniel,Smith,1,NY,18,90.0,80.0
1,Ben,Leibstrom,1,NY,19,80.0,NaN
2,Kavita,Kanabar,1,PA,19,NaN,NaN
3,Linda,Thiel,4,CA,22,60.0,40.0
4,Omar,Reichel,2,OK,21,70.0,50.0
5,Jane,OConner,2,HI,19,NaN,NaN
6,Felicia,Rao,3,NY,20,NaN,NaN
7,Rachel,Crock,1,FL,17,NaN,60.0
8,Bob,McDonald,1,FL,18,98.0,65.0

### Section 5.5.2

In [4]:
df_students['FIRST_NAME']

0     Daniel
1        Ben
2     Kavita
3      Linda
4       Omar
5       Jane
6    Felicia
7     Rachel
8        Bob
Name: FIRST_NAME, dtype: object

In [5]:
df_students.FIRST_NAME

0     Daniel
1        Ben
2     Kavita
3      Linda
4       Omar
5       Jane
6    Felicia
7     Rachel
8        Bob
Name: FIRST_NAME, dtype: object

In [6]:
i = 'HOME_STATE'
df_students[i]

0    NY
1    NY
2    PA
3    CA
4    OK
5    HI
6    NY
7    FL
8    FL
Name: HOME_STATE, dtype: object

In [7]:
df_students[['FIRST_NAME']]

  FIRST_NAME
0     Daniel
1        Ben
2     Kavita
3      Linda
4       Omar
5       Jane
6    Felicia
7     Rachel
8        Bob

In [8]:
df_students[['FIRST_NAME', 'LAST_NAME']]

  FIRST_NAME  LAST_NAME
0     Daniel      Smith
1        Ben  Leibstrom
2     Kavita    Kanabar
3      Linda      Thiel
4       Omar    Reichel
5       Jane    OConner
6    Felicia        Rao
7     Rachel      Crock
8        Bob   McDonald

In [9]:
df_students['FIRST_NAME', 'LAST_NAME']

KeyError: ('FIRST_NAME', 'LAST_NAME')

### Section 5.5.3

In [10]:
df_students.columns = ['FIRST_NAME', 'LAST_NAME', 'YEAR',
                         'HOME_STATE', 'AGE', 'CALC_101_FINAL',
                         'ENGLISH_101_FINAL_SCORE']

In [11]:
df_students

,FIRST_NAME,LAST_NAME,YEAR,HOME_STATE,AGE,CALC_101_FINAL,ENGLISH_101_FINAL_SCORE
0,Daniel,Smith,1,NY,18,90.0,80.0
1,Ben,Leibstrom,1,NY,19,80.0,NaN
2,Kavita,Kanabar,1,PA,19,NaN,NaN
3,Linda,Thiel,4,CA,22,60.0,40.0
4,Omar,Reichel,2,OK,21,70.0,50.0
5,Jane,OConner,2,HI,19,NaN,NaN
6,Felicia,Rao,3,NY,20,NaN,NaN
7,Rachel,Crock,1,FL,17,NaN,60.0
8,Bob,McDonald,1,FL,18,98.0,65.0

In [12]:
df_students.index = [1,2,3,4,5,6,7,8,9]

In [13]:
df_students

,FIRST_NAME,LAST_NAME,YEAR,HOME_STATE,AGE,CALC_101_FINAL,ENGLISH_101_FINAL_SCORE
1,Daniel,Smith,1,NY,18,90.0,80.0
2,Ben,Leibstrom,1,NY,19,80.0,NaN
3,Kavita,Kanabar,1,PA,19,NaN,NaN
4,Linda,Thiel,4,CA,22,60.0,40.0
5,Omar,Reichel,2,OK,21,70.0,50.0
6,Jane,OConner,2,HI,19,NaN,NaN
7,Felicia,Rao,3,NY,20,NaN,NaN
8,Rachel,Crock,1,FL,17,NaN,60.0
9,Bob,McDonald,1,FL,18,98.0,65.0

In [14]:
df_students.rename(columns={'ENGLISH_101_FINAL_SCORE'
                              :'ENGLISH_101_FINAL'})

,FIRST_NAME,LAST_NAME,YEAR,HOME_STATE,AGE,CALC_101_FINAL,ENGLISH_101_FINAL
1,Daniel,Smith,1,NY,18,90.0,80.0
2,Ben,Leibstrom,1,NY,19,80.0,NaN
3,Kavita,Kanabar,1,PA,19,NaN,NaN
4,Linda,Thiel,4,CA,22,60.0,40.0
5,Omar,Reichel,2,OK,21,70.0,50.0
6,Jane,OConner,2,HI,19,NaN,NaN
7,Felicia,Rao,3,NY,20,NaN,NaN
8,Rachel,Crock,1,FL,17,NaN,60.0
9,Bob,McDonald,1,FL,18,98.0,65.0

In [15]:
df_students

,FIRST_NAME,LAST_NAME,YEAR,HOME_STATE,AGE,CALC_101_FINAL,ENGLISH_101_FINAL_SCORE
1,Daniel,Smith,1,NY,18,90.0,80.0
2,Ben,Leibstrom,1,NY,19,80.0,NaN
3,Kavita,Kanabar,1,PA,19,NaN,NaN
4,Linda,Thiel,4,CA,22,60.0,40.0
5,Omar,Reichel,2,OK,21,70.0,50.0
6,Jane,OConner,2,HI,19,NaN,NaN
7,Felicia,Rao,3,NY,20,NaN,NaN
8,Rachel,Crock,1,FL,17,NaN,60.0
9,Bob,McDonald,1,FL,18,98.0,65.0

In [16]:
name = 'Daniel'
name.upper()

'DANIEL'

In [17]:
name

'Daniel'

In [18]:
df_students = (
    df_students.rename(columns={'ENGLISH_101_FINAL_SCORE'
                                :'ENGLISH_101_FINAL'}) )

In [19]:
df_students = df_students.reset_index(drop=True)

### Section 5.5.4

In [20]:
df_students.head()

,FIRST_NAME,LAST_NAME,YEAR,HOME_STATE,AGE,CALC_101_FINAL,ENGLISH_101_FINAL
0,Daniel,Smith,1,NY,18,90.0,80.0
1,Ben,Leibstrom,1,NY,19,80.0,NaN
2,Kavita,Kanabar,1,PA,19,NaN,NaN
3,Linda,Thiel,4,CA,22,60.0,40.0
4,Omar,Reichel,2,OK,21,70.0,50.0

In [21]:
df_students.shape

(9, 7)

In [22]:
df_students.FIRST_NAME()

TypeError: 'Series' object is not callable

In [ ]:
df_students.shape()

In [ ]:
df_students.reset_index

In [ ]:
df_students.reset_index().FIRST_NAME

In [ ]:
df_students.reset_index.FIRST_NAME

### Section 5.5.5

In [ ]:
df_surfboard = 1

In [ ]:
def add_numbers(a, b):
    return a+b

In [ ]:
def add_numbers(a, b):
    '''
    This function takes two numbers, a and b, and returns
    the sum
    '''
    return a+b

In [ ]:
add_numbers

## Section 5.6

### Section 5.6.1

In [ ]:
df_students = pd.read_excel('raw data/Students.xlsx')

In [ ]:
df_summarized_orders = pd.read_csv(
    'raw data/Summarized orders.csv')
df_summarized_orders.head()

In [ ]:
df_summarized_orders.columns = ['RESTAURANT_NAME',
                                 'DATE', 'NUM_ORDERS',
                                          'PERC_DELIVERY']

In [ ]:
df_items = pd.read_csv('raw data/items.csv')
df_restaurants = pd.read_csv('raw data/restaurants.csv')

In [ ]:
df_orders = pd.read_csv('raw data/Simplified orders.zip')
df_orders.shape

### Section 5.6.2

In [ ]:
df_summarized_orders.to_csv('Chapter 5/Summarized orders new.csv')

In [ ]:
df_summarized_orders.to_csv('Chapter 5/Summarized orders new.csv',
                                               index=False)

In [ ]:
df_students.to_pickle('Chapter 5/df_students.pickle')

In [ ]:
pd.read_pickle('Chapter 5/df_students.pickle')

## Section 5.7

In [ ]:
df_orders.info()

In [ ]:
df_orders.DATETIME = pd.to_datetime(df_orders.DATETIME)

In [ ]:
df_orders.info()

In [ ]:
df_orders.head()

In [ ]:
df_orders.DATETIME.dt.day_name().head()

In [ ]:
df_summarized_orders.head()

In [ ]:
df_summarized_orders.DATE = ( 
    pd.to_datetime(df_summarized_orders.DATE) )
df_summarized_orders.head()

## Section 5.8

In [ ]:
df_students.to_pickle('Chapter 5/students.pickle')
df_orders.to_pickle('Chapter 5/orders.pickle')
df_summarized_orders.to_pickle( 
    'Chapter 5/summarized_orders.pickle')
df_items.to_pickle('Chapter 5/items.pickle')
df_restaurants.to_pickle('Chapter 5/restaurants.pickle')